const listWish = [
    {
        code: "fing",
        name: "ฟิงฟิง",
        defaultCount: 5,
        balloons: ["รักนะ <3",":)"],
        messages: [
            "อาจจะมาบอกช้าไปซักหน่อย //เพราะทำลูกโป่งให้เธอกดอยู่อะค้าบ 🤣",
            "ปีที่ผ่านมาเป็นยังไงบ้าง เหนื่อยไหม(กอดๆนะ 🤗❤️)",
            "ขอบคุณนะที่เป็นเด็กดี ...รึปล่าว555",
            "ล้อเล่น เด็กดีของเค้า 😝",
            "ปีที่ผ่านมาเพราะโควิดเลยทำให้อะไรหลายๆอย่างไม่เป็นไปตามแพลนเลย<br>ทั้งไม่ค่อยได้เที่ยว+ไม่ค่อยได้เจอกัน",
            "ยังดีที่ฟิงฟิงแอบมาหา555🤭",
            "เอ้าอะไรที่ผ่านมาแล้วก็ปล่อยมันผ่านไปมาเข้าเรื่องปีใหม่กันดีกว่า",
            "ปีใหม่นี้ขอให้เธอมีความสุขมากกว่าปีที่ผ่านๆมา<br>ใกล้เรียนจบแล้วก็ขอให้ทุกอย่างผ่านไปได้ด้วยดี เรียนจบปุ๊บมีงานปั๊บ<br>\
            หรือถ้าจะเรียนต่อก็ขอให้ได้ทุนนะค้าบ สู้ๆเป็นกำลังใจให้เสมอนะ😘<br>แล้วก็ขอให้สุขภาพแข็งแรง รวยๆๆๆ จะได้ไปเที่ยวกับเค้าอีกเยอะๆ<br>Goooo😎",
            "แล้วก็งอแงน้อยลงหน่อยนะค้าบ5555",
            "ของขวัญปีนี้ให้ไปแล้วเนอะไปหาจังหวะขายเอานะจ๊ะ 😉",
        ]
    }
]

export default listWish;